INSERT INTO
 members
 (
   stage_name,
   stage_name_alphabet,
   stage_name_katakana,
   stage_name_hiragana,
   birth_date,
   blood_type
 )
VALUES
  -- モーニング娘。1期
  ('中澤裕子', 'Yuko Nakazawa', 'ナカザワユウコ', 'なかざわゆうこ', '1973-06-19', 'O'),
  ('石黒彩', 'Aya Ishiguro', 'イシグロアヤ', 'いしぐろあや', '1978-05-12', 'A'),
  ('安倍なつみ', 'Natsumi Abe', 'アベナツミ', 'あべなつみ', '1981-08-10', 'A'),
  ('福田明日香', 'Asuka Fukuda', 'フクダアスカ', 'ふくだあすか', '1984-12-17', 'B'),
  ('飯田圭織', 'Kaori Iida', 'イイダカオリ', 'いいだかおり', '1981-08-08', 'A'),
  -- モーニング娘。2期
  ('市井紗耶香', 'Sayaka Ichii', 'イチイサヤカ', 'いちいさやか', '1983-12-31', 'A'),
  ('保田圭', 'Kei Yasuda', 'ヤスダケイ', 'やすだけい', '1980-12-06', 'A'),
  ('矢口真里', 'Mari Yaguchi', 'ヤグチマリ', 'やぐちまり', '1983-01-20', 'A'),
  -- モーニング娘。3期
  ('後藤真希', 'Maki Goto', 'ゴトウマキ', 'ごとうまき', '1985-09-23', 'A'),
  -- モーニング娘。4期
  ('加護亜依', 'Ai Kago', 'カゴアイ', 'かごあい', '1988-02-07', 'AB'),
  ('辻希美', 'Nozomi Tsuji', 'ツジノゾミ', 'つじのぞみ', '1987-06-17', 'O'),
  ('吉澤ひとみ', 'Hitomi Yoshizawa', 'ヨシザワヒトミ', 'よしざわひとみ', '1985-04-12', 'O'),
  ('石川梨華', 'Rika Ishikawa', 'イシカワリカ', 'いしかわりか', '1985-01-19', 'A'),
  -- モーニング娘。5期
  ('小川麻琴', 'Makoto Ogawa', 'オガワマコト', 'おがわまこと', '1987-10-29', 'O'),
  ('高橋愛', 'Ai Takahashi', 'タカハシアイ', 'たかはしあい', '1986-09-14', 'A'),
  ('紺野あさ美', 'Asami Konno', 'コンノアサミ', 'こんのあさみ', '1987-05-07', 'B'),
  ('新垣里沙', 'Risa Niigaki', 'ニイガキリサ', 'にいがきりさ', '1988-10-20', 'B'),
  -- モーニング娘。6期
  ('藤本美貴', 'Miki Fujimoto', 'フジモトミキ', 'ふじもとみき', '1985-02-26', 'A'),
  ('亀井絵里', 'Eri Kamei', 'カメイエリ', 'かめいえり', '1988-12-23', 'AB'),
  ('道重さゆみ', 'Sayumi Michishige', 'ミチシゲサユミ', 'みちしげさゆみ', '1989-07-13', 'A'),
  ('田中れいな', 'Reina Tanaka', 'タナカレイナ', 'たなかれいな', '1989-11-11', 'O'),
  -- モーニング娘。7期
  ('久住小春', 'Koharu Kusumi', 'クスミコハル', 'くすみこはる', '1992-07-05', 'A'),
  -- モーニング娘。8期
  ('光井愛佳', 'Aika Mitsui', 'ミツイアイカ', 'みついあいか', '1993-01-12', 'O'),
  ('リンリン', 'LinLin', 'リンリン', 'りんりん', '1991-03-11', 'B'),
  ('ジュンジュン', 'JunJun', 'ジュンジュン', 'じゅんじゅん', '1988-01-11', 'O'),
  -- モーニング娘。9期
  ('鞘師里保', 'Riho Sayashi', 'サヤシリホ', 'さやしりほ', '1998-05-28', 'AB'),
  ('譜久村聖', 'Mizuki Fukumura', 'フクムラミズキ', 'ふくむらみずき', '1996-10-30', 'O'),
  ('生田衣梨奈', 'Erina Ikuta', 'イクタエリナ', 'いくたえりな', '1997-07-07', 'A'),
  ('鈴木香音', 'Kanon Suzuki', 'スズキカノン', 'すずきかのん', '1998-08-05', 'B'),
  -- モーニング娘。10期
  ('飯窪春菜', 'Haruna Iikubo', 'イイクボハルナ', 'いいくぼはるな', '1994-11-07', 'O'),
  ('石田亜佑美', 'Ayumi Ishida', 'イシダアユミ', 'いしだあゆみ', '1997-01-07', 'O'),
  ('佐藤優樹', 'Masaki Sato', 'サトウマサキ', 'さとうまさき', '1999-05-07', 'A'),
  ('工藤遥', 'Haruka Kudo', 'クドウハルカ', 'くどうはるか', '1999-10-27', 'A'),
  -- モーニング娘。11期
  ('小田さくら', 'Sakura Oda', 'オダサクラ', 'おださくら', '1999-03-02', 'A'),
  -- モーニング娘。12期
  ('尾形春水', 'Haruna Ogata', 'オガタハルナ', 'おがたはるな', '1999-02-15', 'A'),
  ('野中美希', 'Miki Nonaka', 'ノナカミキ', 'のなかみき', '1999-10-07', 'A'),
  ('牧野真莉愛', 'Maria Makino', 'マキノマリア', 'まきのまりあ', '2001-02-02', 'A'),
  ('羽賀朱音', 'Akane Haga', 'ハガアカネ', 'はがあかね', '2002-03-07', 'O'),
  -- モーニング娘。13期
  ('加賀楓', 'Kaede Kaga', 'カガカエデ', 'かがかえで', '1999-11-30', 'A'),
  ('横山玲奈', 'Reina Yokoyama', 'ヨコヤマレイナ', 'よこやまれいな', '2001-02-22', 'A'),
  -- モーニング娘。14期
  ('森戸知沙希', 'Chisaki Morito', 'モリトチサキ', 'もりとちさき', '2000-02-19', 'A'),
  -- モーニング娘。15期
  ('北川莉央', 'Rio Kitagawa', 'キタガワリオ', 'きたがわりお', '2004-03-16', 'O'),
  ('岡村ほまれ', 'Homare Okamura', 'オカムラホマレ', 'おかむらほまれ', '2005-05-09', 'A'),
  ('山﨑愛生', 'Mei Yamazaki', 'ヤマザキメイ', 'やまざきめい', '2005-06-28', 'B'),
  -- 太陽とシスコムーン
  ('信田美帆', 'Miho Shinoda', 'シノダミホ', 'しのだみほ', '1972-05-18', 'A'),
  ('稲葉貴子', 'Atsuko Inaba', 'イナバアツコ', 'いなばあつこ', '1974-03-13', 'A'),
  ('本多RuRu', 'RuRu Honda', 'ホンダルル', 'ほんだるる', '1976-03-18', 'O'),
  ('小湊美和', 'Miwa Kominato', 'コミナトミワ', 'こみなとみわ', '1977-02-15', 'B'),
  -- シェキドル
  ('北上アミ', 'Ami Kitagawa', 'キタガワアミ', 'きたがわあみ', '1980-07-22', 'B'),
  ('末永真己', 'Mami Suenaga', 'スエナガマミ', 'すえながまみ', '1980-10-23', 'O'),
  ('荒井紗紀', 'Saki Arai', 'アライサキ', 'あらいさき', '1978-03-08', 'A'),
  ('大木衣吹', 'Ibuki Ooki', 'オオキイブキ', 'おおきいぶき', '1982-03-02', 'A'),
  -- ココナッツ娘。
  ('チェルシー', 'Chelsea', 'チェルシー', 'ちぇるしー', '1982-09-26', null),
  ('エイプリル', 'April', 'エイプリル', 'えいぷりる', '1983-04-15', null),
  ('ダニエル', 'Danielle', 'ダニエル', 'だにえる', '1983-09-06', null),
  ('レフア', 'Lehua', 'レフア', 'れふあ', '1983-02-07', 'O'),
  ('ミカ', 'Mika', 'ミカ', 'みか', '1984-05-28', 'A'),
  ('アヤカ', 'Ayaka', 'アヤカ', 'あやか', '1981-10-03', 'AB'),
  -- アイスクリー娘。
  ('シェンシェン', 'ShenShen', 'シェンシェン', 'しぇんしぇん', '1988-01-10', 'O'),
  ('アンチー', 'Anchii', 'アンチー', 'あんちー', '1989-07-23', 'B'),
  ('ペイペイ', 'PeiPei', 'ペイペイ', 'ぺいぺい', '1991-02-10', 'A'),
  ('ヨウコ', 'Yoko', 'ヨウコ', 'ようこ', '1992-08-28', 'A'),
  ('レイレイ', 'ReiRei', 'レイレイ', 'れいれい', '1994-01-16', 'O'),
  ('グーチャン', 'Guu-chan', 'グーチャン', 'ぐーちゃん', '1996-12-14', 'O'),
  -- 美勇伝
  ('三好絵梨香', 'Erika Miyoshi', 'ミヨシエリカ', 'みよしえりか', '1984-11-08', 'B'),
  ('岡田唯', 'Yui Okada', 'オカダユイ', 'おかだゆい', '1987-12-28', 'A'),
  -- SI☆NA
  ('須磨愛', 'Ai Suma', 'スマアイ', 'すまあい', '1992-04- 15', 'A'),
  ('岩嶋雅奈未', 'Manami Iwashima', 'イワシママナミ', 'いわしままなみ', '1989-12-17', 'B'),
  ('阿部麻美', 'Asami Abe', 'アベアサミ', 'あべあさみ', '1990-09-05', 'AB'),
  ('中山菜々', 'Nana Nakayama', 'ナカヤマナナ', 'なかやまなな', '1992-04-03', 'A'),
  -- 大小姐
  ('フランシス', 'Frances', 'フランシス', 'ふらんしす', '2000-12-27', null),
  ('愛子', 'Aiko', 'アイコ', 'あいこ', '2002-12-21', 'O'),
  -- カントリー娘。
  ('里田まい', 'Mai Satoda', 'サトダマイ', 'さとだまい', '1984-03-29', 'A'),
  ('柳原尋美', 'Hiromi Yanagihara', 'ヤナギハラヒロミ', 'やなぎはらひろみ', '1980-10-19', 'A'),
  ('小林梓', 'Azusa Kobayashi', 'コバヤシアズサ', 'こばやしあずさ', '1977-01-30', 'AB'),
  ('りんね', 'Rinne', 'リンネ', 'りんね', '1981-02-06', 'B'),
  ('あさみ', 'Asami', 'アサミ', 'あさみ', '1984-07-17', 'O'),
  ('みうな', 'Miuna', 'ミウナ', 'みうな', '1987-02-12', 'O'),
 -- メロン記念日
 -- 村田めぐみ・斉藤瞳・大谷雅恵・柴田あゆみ
  ('', '', '', '', '--', ''),
  ('', '', '', '', '--', ''),
  ('', '', '', '', '--', ''),
  ('', '', '', '', '--', ''),
  -- ソロ
  ('平家みちよ', 'Michiyo Heike', 'ヘイケミチヨ', 'へいけみちよ', '1979-04-06', 'B'),
  -- 前田有紀
  ('', '', '', '', '--', ''),
  -- 三佳千夏
  ('', '', '', '', '--', ''),
  -- 松浦亜弥
  ('', '', '', '', '--', ''),
  ('', '', '', '', '--', ''),
